app/views/items/index.html.erb

SELECT "items".* FROM "items"
---
        <td>
          <% if not item.item_histories.empty? %>