app/controllers/models_controller.rb

  def index
    @models = Model.all
---
SELECT "models".* FROM "models"

  def create
    @model = Model.new(model_params)

    respond_to do |format|
      if @model.save
---
INSERT INTO "models" ("created_at", "manufacturer_name", "model_name", "updated_at", "vendor_name") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 25 Nov 2013 02:19:24 UTC +00:00], ["manufacturer_name", "fdsa"], ["model_name", "sd"], ["updated_at", Mon, 25 Nov 2013 02:19:24 UTC +00:00], ["vendor_name", "gfda"]]

    def set_model
      @model = Model.find(params[:id])
---
SELECT "models".* FROM "models" WHERE "models"."id" = ? LIMIT 1  [["id", "1"]]